package day16;

import java.util.HashMap;

/*
도시 이름, 위도, 경도 정보를 가진 Location 클래스를 작성하고, 
도시이름을 key로 하는 HashMap<String, Location>컬렉션을 만들고,
사용자로부터 입력받아 4개의 도시를 저장하세요. 
그리고 도시이름으로 검색하는 프로그램을 작성하세요.
실행예시:
	도시, 경도, 위도를 입력하세요.
	>> 서울, 37, 126
	>> LA, 34, -118
	>> 파리, 2, 48
	>> 시드니, 151, -33
	---------------------------
	서울, 37, 126
	LA, 34, -118
	파리, 2, 48
	시드니, 151, -33
	---------------------------
	도시이름 >> 피리
	피리는 없습니다.
	도시이름 >> 파리
	파리 2 48
	도시이름 >> 그만
	프로그램 종료!
*/

public class CollEx11 {
	public static void main(String[] args) {
		
		
		
	}
}
